benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-cal-27624.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56ms  759.61us   4.70ms   66.60%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    2.09ms
 90.000%    2.71ms
 99.000%    3.46ms
 99.900%    3.91ms
 99.990%    4.10ms
 99.999%    4.50ms
100.000%    4.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.046     0.000000            1         1.00
       0.702     0.100000        27237         1.11
       0.896     0.200000        54485         1.25
       1.056     0.300000        81625         1.43
       1.214     0.400000       108741         1.67
       1.387     0.500000       136026         2.00
       1.486     0.550000       149606         2.22
       1.604     0.600000       163131         2.50
       1.750     0.650000       176730         2.86
       1.912     0.700000       190294         3.33
       2.085     0.750000       203993         4.00
       2.175     0.775000       210778         4.44
       2.271     0.800000       217539         5.00
       2.371     0.825000       224271         5.71
       2.477     0.850000       231175         6.67
       2.587     0.875000       237929         8.00
       2.645     0.887500       241290         8.89
       2.711     0.900000       244682        10.00
       2.779     0.912500       248078        11.43
       2.849     0.925000       251479        13.33
       2.921     0.937500       254919        16.00
       2.957     0.943750       256589        17.78
       2.995     0.950000       258322        20.00
       3.035     0.956250       259988        22.86
       3.075     0.962500       261657        26.67
       3.117     0.968750       263348        32.00
       3.141     0.971875       264219        35.56
       3.167     0.975000       265057        40.00
       3.195     0.978125       265897        45.71
       3.229     0.981250       266768        53.33
       3.271     0.984375       267599        64.00
       3.299     0.985938       268025        71.11
       3.339     0.987500       268457        80.00
       3.403     0.989062       268870        91.43
       3.499     0.990625       269298       106.67
       3.591     0.992188       269719       128.00
       3.631     0.992969       269941       142.22
       3.665     0.993750       270156       160.00
       3.699     0.994531       270354       182.86
       3.733     0.995313       270570       213.33
       3.765     0.996094       270788       256.00
       3.781     0.996484       270885       284.44
       3.801     0.996875       270998       320.00
       3.819     0.997266       271103       365.71
       3.835     0.997656       271208       426.67
       3.853     0.998047       271318       512.00
       3.863     0.998242       271374       568.89
       3.875     0.998437       271421       640.00
       3.885     0.998633       271474       731.43
       3.897     0.998828       271529       853.33
       3.911     0.999023       271577      1024.00
       3.923     0.999121       271603      1137.78
       3.933     0.999219       271633      1280.00
       3.941     0.999316       271659      1462.86
       3.949     0.999414       271682      1706.67
       3.963     0.999512       271708      2048.00
       3.973     0.999561       271722      2275.56
       3.983     0.999609       271735      2560.00
       3.997     0.999658       271748      2925.71
       4.015     0.999707       271762      3413.33
       4.035     0.999756       271774      4096.00
       4.047     0.999780       271782      4551.11
       4.059     0.999805       271789      5120.00
       4.067     0.999829       271794      5851.43
       4.077     0.999854       271801      6826.67
       4.081     0.999878       271807      8192.00
       4.089     0.999890       271811      9102.22
       4.103     0.999902       271815     10240.00
       4.107     0.999915       271821     11702.86
       4.107     0.999927       271821     13653.33
       4.131     0.999939       271826     16384.00
       4.131     0.999945       271826     18204.44
       4.143     0.999951       271827     20480.00
       4.187     0.999957       271830     23405.71
       4.191     0.999963       271831     27306.67
       4.211     0.999969       271832     32768.00
       4.247     0.999973       271833     36408.89
       4.331     0.999976       271834     40960.00
       4.455     0.999979       271835     46811.43
       4.467     0.999982       271836     54613.33
       4.467     0.999985       271836     65536.00
       4.503     0.999986       271837     72817.78
       4.503     0.999988       271837     81920.00
       4.511     0.999989       271838     93622.86
       4.511     0.999991       271838    109226.67
       4.511     0.999992       271838    131072.00
       4.587     0.999993       271839    145635.56
       4.587     0.999994       271839    163840.00
       4.587     0.999995       271839    187245.71
       4.587     0.999995       271839    218453.33
       4.587     0.999996       271839    262144.00
       4.703     0.999997       271840    291271.11
       4.703     1.000000       271840          inf
#[Mean    =        1.561, StdDeviation   =        0.760]
#[Max     =        4.700, Total count    =       271840]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  271864 requests in 10.00s, 33.71MB read
Requests/sec:  27184.89
Transfer/sec:      3.37MB