benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-cal-35061.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55ms    1.08ms  26.64ms   88.28%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.88ms
 90.000%    2.54ms
 99.000%    3.98ms
 99.900%   13.82ms
 99.990%   21.71ms
 99.999%   25.90ms
100.000%   26.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.050     0.000000            1         1.00
       0.687     0.100000        34540         1.11
       0.903     0.200000        69086         1.25
       1.061     0.300000       103761         1.43
       1.209     0.400000       138081         1.67
       1.359     0.500000       172552         2.00
       1.439     0.550000       189962         2.22
       1.526     0.600000       207060         2.50
       1.624     0.650000       224317         2.86
       1.734     0.700000       241599         3.33
       1.875     0.750000       258860         4.00
       1.969     0.775000       267452         4.44
       2.073     0.800000       276134         5.00
       2.179     0.825000       284829         5.71
       2.287     0.850000       293403         6.67
       2.411     0.875000       302000         8.00
       2.475     0.887500       306268         8.89
       2.541     0.900000       310607        10.00
       2.613     0.912500       314985        11.43
       2.689     0.925000       319203        13.33
       2.777     0.937500       323608        16.00
       2.823     0.943750       325746        17.78
       2.873     0.950000       327830        20.00
       2.929     0.956250       329975        22.86
       2.993     0.962500       332143        26.67
       3.067     0.968750       334293        32.00
       3.107     0.971875       335397        35.56
       3.145     0.975000       336452        40.00
       3.187     0.978125       337516        45.71
       3.237     0.981250       338635        53.33
       3.295     0.984375       339669        64.00
       3.347     0.985938       340215        71.11
       3.453     0.987500       340754        80.00
       3.725     0.989062       341284        91.43
       4.275     0.990625       341826       106.67
       5.603     0.992188       342363       128.00
       6.339     0.992969       342632       142.22
       7.103     0.993750       342902       160.00
       7.939     0.994531       343173       182.86
       8.631     0.995313       343442       213.33
       9.375     0.996094       343713       256.00
       9.719     0.996484       343847       284.44
      10.191     0.996875       343980       320.00
      10.679     0.997266       344117       365.71
      11.151     0.997656       344251       426.67
      11.671     0.998047       344386       512.00
      12.047     0.998242       344452       568.89
      12.399     0.998437       344519       640.00
      12.799     0.998633       344587       731.43
      13.311     0.998828       344654       853.33
      13.895     0.999023       344723      1024.00
      14.191     0.999121       344755      1137.78
      14.639     0.999219       344790      1280.00
      15.071     0.999316       344825      1462.86
      15.735     0.999414       344856      1706.67
      16.879     0.999512       344890      2048.00
      17.471     0.999561       344907      2275.56
      17.999     0.999609       344924      2560.00
      18.527     0.999658       344941      2925.71
      19.135     0.999707       344957      3413.33
      19.647     0.999756       344974      4096.00
      20.079     0.999780       344983      4551.11
      20.319     0.999805       344991      5120.00
      20.767     0.999829       345000      5851.43
      20.975     0.999854       345008      6826.67
      21.391     0.999878       345016      8192.00
      21.615     0.999890       345021      9102.22
      21.919     0.999902       345025     10240.00
      22.255     0.999915       345029     11702.86
      22.575     0.999927       345033     13653.33
      22.895     0.999939       345037     16384.00
      23.167     0.999945       345040     18204.44
      23.439     0.999951       345043     20480.00
      23.615     0.999957       345044     23405.71
      23.919     0.999963       345046     27306.67
      24.799     0.999969       345048     32768.00
      24.895     0.999973       345049     36408.89
      24.943     0.999976       345050     40960.00
      25.215     0.999979       345051     46811.43
      25.327     0.999982       345052     54613.33
      25.439     0.999985       345053     65536.00
      25.615     0.999986       345054     72817.78
      25.615     0.999988       345054     81920.00
      25.903     0.999989       345055     93622.86
      25.903     0.999991       345055    109226.67
      25.919     0.999992       345056    131072.00
      25.919     0.999993       345056    145635.56
      25.919     0.999994       345056    163840.00
      26.175     0.999995       345057    187245.71
      26.175     0.999995       345057    218453.33
      26.175     0.999996       345057    262144.00
      26.175     0.999997       345057    291271.11
      26.175     0.999997       345057    327680.00
      26.655     0.999997       345058    374491.43
      26.655     1.000000       345058          inf
#[Mean    =        1.545, StdDeviation   =        1.078]
#[Max     =       26.640, Total count    =       345058]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  345060 requests in 10.00s, 42.78MB read
Requests/sec:  34505.97
Transfer/sec:      4.28MB